In [6]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

pd.set_option("display.max_columns", None)
pd.set_option("display.max_rows", 100)

  ID_cliente   Edad  Ingreso_mensual Categoría     Ciudad    País
0     ID_001   -1.0              NaN         b        NaN     NaN
1     ID_002    NaN              NaN         b   Ciudad_B  Pais_Y
2     ID_003  150.0          7646.28         A   Ciudad_B     NaN
3     ID_004   30.0          -500.00       VIP  Ciudad123  Pais_X
4     ID_005  150.0              NaN         a   ciudad_a  Pais_X

In [ ]:
#Cargar CSV
df = pd.read_csv("clientes_con_errores.csv")

df.head()

In [ ]:
#Diagnóstico inicial (OBLIGATORIO de Model Leader)

df.info()

In [ ]:
#Revisar valores nulos

df.isnull().sum()

In [ ]:
#Revisar duplicados

df.duplicated().sum()

In [15]:
#Estadísticas básicas

df.describe(include='all')

       ID_cliente        Edad  Ingreso_mensual Categoría    Ciudad    País
count         501  501.000000       257.000000       442       406     251
unique        453         NaN              NaN         6         5       2
top        ID_045         NaN              NaN         A  Ciudad_A  Pais_X
freq            4         NaN              NaN       102        97     130
mean          NaN   51.790419      4976.575875       NaN       NaN     NaN
std           NaN   10.992269      6771.690431       NaN       NaN     NaN
min           NaN   18.000000      -500.000000       NaN       NaN     NaN
25%           NaN   52.000000      -500.000000       NaN       NaN     NaN
50%           NaN   52.000000      1121.380000       NaN       NaN     NaN
75%           NaN   52.000000     11022.800000       NaN       NaN     NaN
max           NaN   89.000000     19851.930000       NaN       NaN     NaN

In [7]:
#Tipos de datos
df.info()

#Nulos
df.describe(include='all')

#Valores únicos
df.isna().sum()

#Estadísticas de columnas
df.nunique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 501 entries, 0 to 500
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID_cliente       501 non-null    object
 1   Edad             390 non-null    float64
 2   Ingreso_mensual  257 non-null    float64
 3   Categoría        442 non-null    object
 4   Ciudad           406 non-null    object
 5   País             251 non-null    object
dtypes: float64(2), object(4)
memory usage: 23.6+ KB

ID_cliente         453
Edad                61
Ingreso_mensual    131
Categoría            6
Ciudad               5
País                 2
dtype: int64

In [9]:
# Convertir Edad a número, forzando errores a NaN
df["Edad"] = pd.to_numeric(df["Edad"], errors="coerce")

# Verificar resultado
df["Edad"].head(10)

0     -1.0
1      NaN
2    150.0
3     30.0
4    150.0
5     -1.0
6     -1.0
7     -1.0
8     48.0
9      NaN
Name: Edad, dtype: float64

In [10]:
# Convertimos edades imposibles a NaN
df.loc[(df["Edad"] < 0) | (df["Edad"] > 120), "Edad"] = np.nan

df["Edad"].describe()

count    130.000000
mean      51.192308
std       21.629758
min       18.000000
25%       32.000000
50%       52.000000
75%       68.000000
max       89.000000
Name: Edad, dtype: float64

In [17]:
# Calcular mediana real
mediana_edad = df["Edad"].median()

# Imputar valores faltantes con mediana
df["Edad"] = df["Edad"].fillna(mediana_edad)

# Verificar resultado
df["Edad"].describe()

count    501.000000
mean      51.790419
std       10.992269
min       18.000000
25%       52.000000
50%       52.000000
75%       52.000000
max       89.000000
Name: Edad, dtype: float64

In [13]:
df["Edad"] = df["Edad"].astype(int)
df["Edad"].dtype

dtype('int64')